//Аркадий — большой фанат использования машинного обучения в любой задаче. Он верит в безграничную силу волшебства этой
//популярной молодой науки. Именно поэтому Аркадий постоянно постоянно придумывает всё новые и новые факторы, которые можно
//вычислить для различных объектов.
//Напомним, палиндромом называется строка, которая одинаково читается от начала к концу и от конца к началу.
// Для каждой строки в своей базе данных Аркадий хочет найти самую короткую её подстроку, состоящую хотя бы из двух
// символов и являющуюся палиндромом. Если таких подстрок несколько, Аркадий хочет выбрать лексикографически минимальную.



public class FactorPolindroma {
    public static void main(String[] args) {

    }
}
